repaso_nuevo22/app/Controllers/LineasTelefonicasController.php

    public  function index(): string
    {
        $lineas = new LineasTelefonicasModel();
        $datos ['datos']=$lineas->findAll();
---
SELECT *
FROM `lineas_telefonicas`