repaso_nuevo22/app/Controllers/PlanesController.php

    public function index(): string
    {
        $planes = new PlanesModel();
        $datos ['datos']=$planes->findAll();
---
SELECT *
FROM `planes`

    public function buscarPlan($id=null){
        //echo "id o codigo: ".$id;
        $planes = new PlanesModel();
       $datos['datos'] =$planes ->where ('plan_id', $id)->first();
---
SELECT *
FROM `planes`
WHERE `plan_id` = '1'
 LIMIT 1